app/controllers/tweet_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def new
    @tweet_item = Tweet.all

INSERT INTO "tweets" ("created_at", "msg", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-05-28 19:47:56.569475"], ["msg", "ausehuasheusahue"], ["updated_at", "2014-05-28 19:47:56.569475"]]
---
  def create
    @tweet_item = Tweet.new(sec_params)

    @tweet_item.save

SELECT  "tweets".* FROM "tweets"  WHERE "tweets"."id" = ? LIMIT 1  [["id", 0]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 9]]
---
  def destroy
    @tweet_item = Tweet.find(params[:id])

    @tweet_item.destroy